title: Possible Thunderbird Credential Stealer via Strela Stealer Malware
id: 42c9882d-9239-4e58-bdbc-da07ce1cb306
status: experimental
description: This rule detects an attempt to access to account log-in credentials of thunderbird email via searching profiles directory which contains password database.
references:
- https://www.pcrisk.com/removal-guides/25256-strelastealer-malware
- https://www.secureblink.com/cyber-security-news/outlook-and-thunderbird-actively-targeted-by-new-strela-stealer-malware
author: Emre Ay
date: 2022/11/11
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains:
    - \Thunderbird\Profiles\
  filter:
    Image|endswith: thunderbird.exe
  condition: selection and not filter
falsepositives:
- Legitimate Thunderbird activity
tags:
- attack.credential_access
- attack.t1528
level: medium
