title: Detected suspicious commands usage for System Time Discovery
id: acf4482a-96b3-491d-b52f-2d54616d76d4
status: stable
description: Identifies use of various commands to query a systems time. This technique may be used before executing a scheduled task or to discover the time zone of a target system.
author: Emre Ay
date: 2022/10/30
references:
- https://attack.mitre.org/techniques/T1124/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1124/T1124.md
- https://zerodollarsoc.com/attack-defence-catalogue/techniques/t1124-system-time-discovery-discovery/
logsource:
  category: process_creation
  product: windows
detection:
  selection_net:
    Image|endswith:
    - net.exe
    - net1.exe
    CommandLine|contains:
    - time
  selection_w32:
    Image|endswith:
    - w32tm.exe
    CommandLine|contains:
    - tz
  selection_ps:
    Image|endswith:
    - powershell.exe
    CommandLine|contains:
    - get-date
  condition: selection_net or selection_w32 or selection_ps
falsepositives:
- Legitimate administrative activities
level: medium
tags:
- attack.t1124
- attack.Execution
- attack.Discovery
