title: Possible Discovery Activity to Get BIOS Information Through Associated Registry Key ( via process_creation)
status: stable
description: This rule detects the threat actors that attempt to query to the associated registry key for getting BIOS information which allows the threat actors to detect sandboxing environments on victim system.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1082/T1082.md#atomic-test-30---bios-information-discovery-through-registry
author: Emre Ay
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - 'reg.exe'
    CommandLine|contains|all:
    - 'query'
    - '\HARDWARE\DESCRIPTION\System'
    CommandLine|contains:
    - 'SystemBiosVersion'
    - 'VideoBiosVersion'
  condition: selection
falsepositives:
- Legitimate administrative activities
tags:
- attack.discovery
- attack.t1082
- attack.t1012
level: low
