title: Possible Registry Key Modification to Turn off Creation of System Restore Checkpoints (via registry_event )
status: stable
description: This rule detects the suspicious modification of associated registry key to disable creation of system restore checkpoints which inhibits system recovery when the threat actors install malicious application on the victim system. The threat actors generally use this technique before install their malicious application.
author: Emre Ay
references:
- https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.MSI::MSI_DisableSRCheckPoints
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    TargetObject|endswith:
    - '\Policies\Microsoft\Windows\Installer\LimitSystemRestoreCheckpointing'
    Details:
    - 'DWORD (0x00000001)'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.defense_evasion
- attack.t1112
level: medium
