title: Possible Windows Event Logs Enumeration by Detection of Associated Commands ( via process_creation)
status: stable
description: This rule detects the enumeration activity to get all available event logs such as security, application, system on compromised system. The threat actors can use this method to discover potantial weaknesses in the logging configuration and after getting these information they can modify their further attacks. 
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1654/T1654.md#atomic-test-2---enumerate-windows-security-log-via-wevtutil
author: Emre Ay
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - 'wevtutil.exe'
    CommandLine|contains:
    - 'enum-logs'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.discovery
- attack.t1654
level: high
