title: Possible Windows Backup Deleted Via Wbadmin.EXE ( via process_creation)
id: 6e014dc0-7561-4468-a02b-b4bfc8c66cda
status: stable
description: This rule Detects the deletion of backups or system state backups via "wbadmin.exe". This technique is used by numerous ransomware families and actors. This may only be successful on server platforms that have Windows Backup enabled..
references:
- https://www.logpoint.com/en/blog/detect-manage-and-respond-clop-ransomware/#
author: Emre Ay
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - 'wbadmin.exe'
    CommandLine|contains|all:
    - 'delete'
    - 'systemstatebackup'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.impact
- attack.t1490
level: high
