title: Possible BlackCat Ransomware Command Execution And Recon Activity to Get UUID ( via process_creation)
id: eda20518-bad9-4d69-890d-d5146ce81126
status: stable
description: This rule detects BlackCat Ransomware execution and recon activities to get UUID from the victim system.
references:
- https://www.logpoint.com/en/blog/hunting-and-remediating-blackcat-ransomware/#
author: Emre Ay
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - 'wmic.exe'
    CommandLine|contains|all:
    - 'csproduct'
    - 'get'
    - 'UUID'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.discovery
- attack.t1082
level: medium
