title: Possible VSS Backup Resize Activity by Detection of Associated Commands ( via process_creation)
id: 6e014dc0-7561-4468-a02b-b4bfc8c66cda
status: stable
description: This rule Detects scenarios where an attacker attempts to delete or resize existing VSS backup.
references:
- https://www.logpoint.com/en/blog/detect-manage-and-respond-clop-ransomware/#
author: Emre Ay
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - 'vssadmin.exe'
    CommandLine|contains|all:
    - 'resize'
    - 'shadowstorage'
    - 'unbounded'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.impact
- attack.t1490
level: high
