title: Possible Net.exe Commands to Disable Logoff Unrestricted Password Age ( via process_creation)
id: 6e014dc0-7561-4468-a02b-b4bfc8c66cda
status: stable
description: This rule detects suspicious Net.exe commands to disable logoff and the password age was set to unlimited.
references:
- https://www.logpoint.com/en/blog/hunting-and-remediating-blackcat-ransomware/#
author: Emre Ay
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - 'net.exe'
    CommandLine|contains|all:
    - 'forcelogoff:no'
    - 'maxpwage:unlimited'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.execution
- attack.t1059.003
level: high
