title: Possible Registry Key Modification to Allow Unauthorized Access to the Sensitive Data (via registry_event )
status: stable
description: This rule detects the suspicious modification of associated registry key which allow users to share files in their profiles that may provide unauthorized access or result in the exposure of sensitive data.
author: Emre Ay
references:
- https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.NetworkSharing::NoInplaceSharing
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    TargetObject|endswith:
    - '\Windows\CurrentVersion\Policies\Explorer\NoInplaceSharing'
    Details:
    - 'DWORD (0x00000000)'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.defense_evasion
- attack.t1112
level: medium
