title: Possible Persistence Activity of BlackCat Ransomware by Creating Suspicious Scheduled Task ( via process_creation)
id: eda20518-bad9-4d69-890d-d5146ce81126
status: stable
description: This rule detects schtasks execution with suspicious taskrun parameter to maintain persistence on victim system and execute the malware.
references:
- https://www.logpoint.com/en/blog/hunting-and-remediating-blackcat-ransomware/#
author: Emre Ay
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - 'schtasks.exe'
    CommandLine|contains|all:
    - '\AppData\Local\Temp\'
    - 'ServiceADS'
    - 'cachetask'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.execution
- attack.persistence
- attack.t1053.005
level: medium
