title: Possible Enumeration Activity to Get Credentials in Google Cloud Kubernetes Cluster (via gcpaudit)
status: stable
description: This rule detects the discovery activity that aim to get credentials for running clusters in GCP via associated commands.
references:
- https://unit42.paloaltonetworks.com/privilege-escalation-llm-model-exfil-vertex-ai/
author: Emre Ay
logsource:
    product: gcp
    service: gcp.audit
detection:
    selection:
        gcp.audit.method_name|contains|all:
            - 'clusters'
            - 'get-credentials'
    condition: selection
falsepositives:
-Unlikely
tags:
- attack.discovery
- attack.t1087.004
level: high
