title: Possible Delete Volume Shadow Copies on Windows by Detection of Associated Commands ( via process_creation)
status: stable
description: This rule detects deletes Windows Volume Shadow Copies. This technique is used by numerous ransomware families and APT malware such as Olympic Destroyer. Upon execution, if no shadow volumes exist the message "No items found that satisfy the query." will be displayed. If shadow volumes are present, it will delete them without printing output to the screen. This is because the /quiet parameter was passed which also suppresses the y/n confirmation prompt. Shadow copies can only be created on Windows server or Windows 8.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md#atomic-test-1---windows---delete-volume-shadow-copies
author: Emre Ay
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - 'vssadmin.exe'
    CommandLine|contains|all:
    - 'delete'
    - 'shadows'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.impact
- attack.t1490
level: high
