title: Possible BianLian Ransomware Group Activity by Creating Suspicious Schedule Task ( via process_creation)
status: stable
description: This rule detects suspicious activity of the bianlian ransomware group which attempt to create schedule task in order to run the malicious DLL file when the task is triggered.
references:
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-136a
author: Emre Ay
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - 'schtasks.exe'
    CommandLine|contains|all:
    - 'netsh.dll'
    - 'Entry'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.execution
- attack.persistence
- attack.t1053.005
level: medium
