title: Possible Registry Key Modification to Enable Installing Packages via non-admin Users (via  registry_event )
status: stable
description: This rule detects the suspicious modification of associated registry key which allows the non-Administrator users to install Windows app packages. The threat actors may abuse this setting by replacing windows packages with malicious files masquerading as windows app packages and run this replaced malicious packeges via non-admin users rights on victim system.
author: Emre Ay
references:
- https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.Appx::BlockNonAdminUserInstall
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    TargetObject|endswith:
    - '\Policies\Microsoft\Windows\Appx\BlockNonAdminUserInstall'
    Details:
    - 'DWORD (0x00000000)'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.defense_evasion
- attack.t1112
level: medium
