title: Possible Defense Evasion Activity by Disabling Journal Logging on Linux via Associated Commands (via process_creation)
status: stable
description: This rule detects suspicious command execution on compromised linux system to disable journal logging which allows to disable the data storage function of systemd-journald on the disk.
author: Emre Ay
references:
-  https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562/T1562.md#atomic-test-2---disable-journal-logging-via-systemctl-utility
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - 'systemd-journald'   
    - 'stop'
  condition: selection
falsepositives:
- Unlikely
level: high
tags:
- attack.defense_evasion
- attack.t1562.012
