title: Possible Command Execution to Enumerate Stored Certificates on Linux (via process_creation)
id: e2e526e7-93c3-45a5-8e57-3a45c26bad19
status: stable
description: This rule detects the suspicious command execution to get stored certificates from the linux environment via using associated commands.
author: Emre Ay
references:
- https://github.com/0xJs/RedTeaming_CheatSheet/blob/main/windows-ad/Post-Exploitation.md#find-certs-in-etcssl
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - 'ls'
    - '-lsaR'
    - '/etc/ssl'
  condition: selection
falsepositives:
- The possible admin activity
level: low
tags:
- attack.discovery
- attack.t1083
