title: Possible Credential Dumping Through LSASS Access via Suspicious Process by Detection of Associated Commands (via process_access)
status: stable
description: This rule detects credential dumping activity via accessing Lsass process by using associated suspicious process.
author: Emre Ay
references:
- https://www.splunk.com/en_us/blog/security/you-bet-your-lsass-hunting-lsass-access.html
logsource:
  category: process_access
  product: windows
detection:
  selection:
    SourceImage|endswith:
     - 'PasswordHashesView.exe'
    TargetImage|endswith: 
     -'\lsass.exe'
    GrantedAccess: '0x1410'
  condition: selection
tags:
- attack.credential_access
- attack.t1003.001
falsepositives:
- Unlikely
level: high
