title: Possible Persistence Activity via BadSpace Backdoor by Detection of Associated Commandline  ( via process_creation)
status: stable
description: This rule detects suspicious command execution of the malware related with badspace backdoor that sets up persistence using COM with the Windows Task Scheduler to configure the DLL to run with the associated parameters.
references:
- https://www.gdatasoftware.com/blog/2024/06/37947-badspace-backdoor
author: Emre Ay
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - 'rundll32.exe'
    CommandLine|contains|all:
    - '\RtlUpd.dll'
    - 'Start'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.execution
- attack.persistence
- attack.defense_evasion
- attack.t1218.011
level: medium
