title: Possible AWS Password Policy Discovery via Associated Commands (via process_creation)
status: stable
description: This rule detects the threat actors that attempt to perform discovery activity to get password policy for the current AWS Account on victim system.
author: Emre Ay
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1201/T1201.md#atomic-test-12---examine-aws-password-policy
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - 'get-account-password-policy'
    - 'iam'
    - 'aws'
  condition: selection
falsepositives:
- Possible admin activity
level: medium
tags:
- attack.discovery
- attack.t1201
