title: Possible Registry Key Modification to Disable Controlled Folder Access Feature (via  registry_event )
status: stable
description: This rule detects the modification of associated registry key which allows the threat actors to make changes to a file in a protected folder and make vulnerable the valuable data from malicious apps and threats.
author: Emre Ay
references:
- https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.WindowsDefender::ExploitGuard_ControlledFolderAccess_ProtectedFolders
- https://www.elevenforum.com/t/add-or-remove-protected-folders-for-controlled-folder-access-in-windows-11.4015/
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    TargetObject|endswith:
    - '\Windows Defender Exploit Guard\Controlled Folder Access\ExploitGuard_ControlledFolderAccess_ProtectedFolders'
    Details:
    - 'DWORD (0x00000000)'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.defense_evasion
- attack.t1112
level: medium
