title: Possible Persistence Activity by Creating New JEA (Just Enough Admin) Endpoint (via ps_script)
status: stable
description: This rule detects the suspicious powershell command execution that aim to create new JEA endpoint on the victim machine which provides administrator privileges.
author: Emre Ay
references:
- https://github.com/0xJs/RedTeaming_CheatSheet/blob/main/windows-ad/Host-Persistence.md#just-enough-admin
logsource:
  product: windows
  category: ps_script
detection:
  selection:
    ScriptBlockText|contains|all:
    - 'Set-JEAPermissions'
    - '-ComputerName'
    - '-SamAccountName'
  condition: selection
falsepositives:
- Unlikely
level: medium
tags:
- attack.persistence
- attack.execution
- attack.t1059.001
