title: Possible Credential Harvesting Activity by Detection of Associated Commandline (via process_creation)
id: 47456ce4-6420-4ba6-a584-12066532cd05
status: stable
description: This rule detects the suspicious command execution that aim to collect credentials information from the victim system by using Rundll32 via associated parameter.
references:
- https://www.rapid7.com/blog/post/2024/12/04/black-basta-ransomware-campaign-drops-zbot-darkgate-and-custom-malware/
author: Emre Ay
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - 'rundll32.exe'
    CommandLine|contains|all:
    - 'SafeStore.dll'
    - 'epaas_request_clone'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.credential_access
- attack.t1056.001
- attack.defense_evasion
- attack.t1218.011
level: high
