title: Possible Registry Key Modification to Allow RDP Connections and Create Persistence (via registry_event )
status: stable
description: This rule detects the utilization of reg.exe in order to set dangerous registry keys to establish persistence and allow RDP connections.
author: Emre Ay
references:
- https://symantec-enterprise-blogs.security.com/threat-intelligence/ransomware-data-exfiltration
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    TargetObject|endswith:
    - '\CurrentControlSet\Control\Terminal Server\fDenyTSConnections'
    Details:
    - 'DWORD (0x00000000)'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.defense_evasion
- attack.t1112
level: high
