title: Possible Redline Stealer Activity by Detection of Associated Web Traffic (via webserver)
status: stable
description: This rule detects the threat actors related with redline stealer activity that attempt to HTTP Get request to check some information about victim system such as Ip , countrycode, timezone etc.
author: Emre Ay
references:
- https://www.mcafee.com/blogs/other-blogs/mcafee-labs/redline-stealer-a-novel-approach/
logsource:
  category: webserver
detection:
  selection:
    cs-method: GET
    c-uri|contains|all:
    - 'fields='
    - 'query'
    - 'status'
    - 'countryCode'
    - 'city'
    - 'timezone'
    c-useragent:
    - 'Winter'
  condition: selection
falsepositives:
- Unlikely
level: high
tags:
- attack.reconnaissance
- attack.t1590.005
- attack.initial_access
- attack.t1190
