title: Possible Registry Key Modification to Disable SmartScreen Filter Scan for the Internet Zone(via registry_event )
status: stable
description: SmartScreen filter scan mechanism is designed to protect users from potentially harmful pages that has malicious content. This rule detects the suspicious modification of associated registry key to turn off SmartScreen Filter Scan settings allowing the threat actors to access to pages that malicious content that SmartScreen hasn't scanned.
author: Emre Ay
references:
- https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.InternetExplorer::IZ_Policy_Phishing_1
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    TargetObject|endswith:
    - '\Microsoft\Windows\CurrentVersion\Internet Settings\Zones\3\2301'
    Details:
    - 'DWORD (0x00000003)'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.defense_evasion
- attack.t1112
level: medium
