title: Potantial Unwanted Registry Key Modification to Enumerate Local Administrator Accounts (via  registry_event )
status: stable
description: This rule detects the modification of associated registry key which allows the threat actors to enumerate all local administrator accounts on the victim system.
author: Emre Ay
references:
- https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.CredentialsUI::EnumerateAdministrators
- https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-credentialsui
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    TargetObject|endswith:
    - '\Policies\CredUI\EnumerateAdministrators'
    Details:
    - 'DWORD (0x00000001)'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.defense_evasion
- attack.t1112
level: medium
