title: Suspicious Service Created by Adding Associated Registry Key ( via process_creation)
status: stable
description: This rule detects the suspicious commandline that aim to download possible malicious script from the remote server by using associated commandline.
references:
- https://www.trendmicro.com/en_us/research/24/j/unmasking-prometei-a-deep-dive-into-our-mxdr-findings.html
author: Emre Ay
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - 'sqhost.exe'
    CommandLine|contains:
    - '/chkxwget'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.execution
- attack.t1059.003
level: high
