title: Suspicious Command Execution to Collect Associated Data via Microsoft Utility (via process_creation)
id: e6c87378-48f1-4a56-9f5a-d865be8f80b2
status: stable
description: This rule detects the command execution that aim to collect performance data such as Process Queue Length details in the processors on victim system by using microsoft utility via associated parameters. 
references:
- https://thedfirreport.com/2024/12/02/the-curious-case-of-an-egg-cellent-resume/
author: Emre Ay
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - 'typeperf.exe'
    CommandLine|contains|all:
    - '\System\Processor'
    - 'Queue'
    - 'Length'
    - '-si'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.discovery
- attack.t1082
level: high
