title: Suspicious Command Execution to Connect with the C2 Server by Using Rundll32.exe (via process_creation)
id: e6b955bb-50b6-429c-b76f-3853b5c6ad1b
status: stable
description: This rule detects the command execution that aim to evade detection and connect with the command and control server by using system binary,Rundll32.exe, with associated parameter. 
references:
- https://www.genians.co.kr/blog/edr-threat-hunting
author: Emre Ay
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - 'rundll32.exe'
    CommandLine|contains|all:
    - 'adb.dll'
    - 'Control_RunDLL'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.defense_evasion
- attack.t1218.011
level: high
