title: Suspicious Discovery Activity to Get OS Build Number via Associated Registry Query  (via process_creation)
id: 0dcae26a-e6c5-4f01-9588-0340a4b8b512
status: stable
description: This rule detects the suspicious registry query execution to discover OS build number of the victim system. After getting information from the  victim system, the threat actors can use this information for preparing their further attacks.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1082/T1082.md#atomic-test-40---discover-os-build-number-via-registry
author: Emre Ay
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - 'reg.exe'
    CommandLine|contains|all:
    - 'query'
    - 'HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion'
    - 'CurrentBuildNumber'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.discovery
- attack.t1082
level: medium
