title: Suspicious Command Execution to Perform SCCM Reconnaissance and Get SCCM Properties (via ps_script)
status: stable
description:This rule detects the powershell command ADSISearcher with associated parameter that aim to enumerate whether SCCM is present in a victim environment and get properties such as SCCM site code, SCCM Management point etc.
author: Emre Ay
references:
- https://www.thehacker.recipes/ad/movement/sccm-mecm/#recon
logsource:
  product: windows
  category: ps_script
detection:
  selection:
    ScriptBlockText|contains|all:
    - 'ADSISearcher'
    - 'objectClass'
    - 'mSSMSManagementPoint'
    - 'Properties'
  condition: selection
falsepositives:
- Unlikely
level: medium
tags:
- attack.discovery
- attack.execution
- attack.t1059.001
