title: Suspicious Command Execution Activity of Egregor Ransomware to Evade Detection by Using Rundll32.exe  ( via process_creation)
id: 4e06c650-9648-4bd8-9054-1b802a22fcb0
status: stable
description: This rule detects command execution which performs by egregor ransomware that aim to compromise organizations, steal sensitive user data, encrypt data, and demand a ransom to exchange encrypted documents. 
references:
- https://www.logpoint.com/en/blog/theres-a-new-ransomware-in-town-detecting-egregor-using-logpoint/
author: Emre Ay
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - 'rundll32.exe'
    CommandLine|contains|all:
    - 'DllRegisterServer'
    - '-multiproc'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.defense_evasion
- attack.t1218.011
level: high
