title: Suspicious Command Execution to Search for Resource-Based Constrained Delegation Attack Paths (via ps_script)
status: stable
description:This rule detects the suspicious command execution that aim to search for RBCD attack path in the victim environment to be able to perform further RBCD attack.
author: Emre Ay
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1082/T1082.md#atomic-test-20---winpwn---rbcd-check
- https://blog.netwrix.com/2022/09/29/resource-based-constrained-delegation-abuse/
logsource:
  product: windows
  category: ps_script
detection:
  selection:
    ScriptBlockText|contains|all:
    - 'RBCD-Check'
    - '-consoleoutput'
    - '-noninteractive'
  condition: selection
falsepositives:
- Unlikely
level: medium
tags:
- attack.discovery
- attack.execution
- attack.t1059.001
