title: Suspicious Enabling WinRM Remote Shell Access By Modifying Associated Registry Key (via registry_event)
status: stable
description: This rule detecs possible enabling winrm remote shell access via associated registry key.
author: Emre Ay
references:
- https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.WindowsRemoteShell::AllowRemoteShellAccess
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    TargetObject|endswith:
    - '\Microsoft\Windows\WinRM\Service\WinRS\AllowRemoteShellAccess'
    Details:
    - 'DWORD (0x00000001)'
  condition: selection
falsepositives:
- Unlikely
tags:
- attack.defense_evasion
- attack.t1112
level: medium
